{
  "header": {
    "all_directions": "Barcha yo'nalishlar",
    "department": "Kafedra",
    "about_us": "Biz haqimizda",
    "teachers": "O'qituvchilar",
    "directions": "Yo'nalishlar",
    "bachelors": "ISE (Bakalavr)",
    "masters": "AI (Magistratura)",
    "news": "Yangiliklar",
    "apply": "Ariza qoldirish",
    "menu": "Menyu"
  },
  "main": {
    "sectionOne": {
      "title": "Axborot tizimlari muhandisligi",
      "description": "Biz IT mutaxassislarini tayyorlaymiz va odamlarga texnologiya va raqamli ko'nikmalarni o'zlashtirishga yordam beramiz."
    },
    "sectionTwo": {
      "title": "Kafedra haqida",
      "subSectionOne": {
        "descriptionOne": "Axborot tizimlari muhandisligi matematika, biznes va kompyuter fanlari kabi fanlarni birlashtiradigan interfaol soha hisoblanadi. Axborot tizimlari muhandislari asosan ma'lumotlar uchun ishlatiladigan tizimlarni loyihalash, ishlab chiqish, sinovdan o'tkazish va saqlash bilan shug'ullanadi. Axborot tizimlari turli shakllarda bo'lishi mumkin, masalan geografik axborot tizimlari, meteorologik tasvirlarni qayta ishlash yoki aloqa tarmoqlari.",
        "descriptionTwo": "Axborot tizimlari muhandislari davlat va xususiy sektorlarda, jumladan mudofaa agentliklari, tibbiyot korxonalari yoki moliya korporatsiyalarida ishlaydi."
      },
      "subSectionTwo": {
        "cardOne": {
          "title": "sohalar",
          "description": "AXB fakulteti axborot texnologiyalarining 6 ta sohasini birlashtiradi"
        },
        "cardTwo": {
          "title": "yillar",
          "description": "AXB fakulteti axborot texnologiyalarining 8 ta sohasini birlashtiradi"
        }
      },
      "subSectionThree": {
        "title": "IT innovatsiyalarni o'rganishning ijodiy yondashi",
        "description": "Zamonaviy dastur va axborot texnologiyalarini o'qitish metodologiyasi talabalarning materiallarni samarali o'zlashtirishiga e'tibor qaratilgan"
      }
    },
    "sectionThree": {
      "title": "O'qituvchilar",
      "description": "Ilmiy kengash va kurs o'qituvchilari butun dunyo bo'ylab tan olingan ajoyib rus olimlari, doktorlar va fan nomzodlardir. Oldini olish, integrativ va qarishga qarshi tibbiyot sohasidagi amaliyotchi mutaxassislar.",
      "descriptionTwo": "IT sohasida oliygina rivojlangan mentorlar",
      "button": "Ko'proq"
    },
    "sectionFour": {
      "title": "Biz talabalarga taklif qilamiz",
      "descriptionOne": "O'quv dasturlari talabalardan olingan so'rovnomalar natijalariga ko'ra yangilanadi",
      "descriptionTwo": "Kurator va mentor talabaning o'qish jarayonining barcha bosqichlarida hamkorlik qiladi",
      "descriptionThree": "O'z startap loyihangizni amalga oshirish uchun barcha shart-sharoitlar yaratilgan",
      "descriptionFour": "Talabalar dunyo bo'ylab turli IT kompaniyalarida amaliyot o'tish imkoniyatiga ega"
    },
    "sectionFive": {
      "title": "Bizning yo'nalishlarimiz",
      "description": "Universial o'quv dasturi axborot texnologiyalarining ko'plab sohalarini qamrab oladi, bu esa talabalar uchun o'z yo'nalishini tanlash imkonini beradi",
      "cards": {
        "one": {
          "title": "ISE (Bakalavr)",
          "descriptionOne": "Bakalavr",
          "descriptionTwo": "4 yil"
        },
        "two": {
          "title": "AI (Magistratura)",
          "descriptionOne": "Magistratura",
          "descriptionTwo": "2 yil"
        }
      }
    }
  },
  "courses": {
    "title": "Bizning yo'nalishlarimiz",
    "description": "Universial o'quv dasturi axborot texnologiyalarining ko'plab sohalarini qamrab oladi, bu esa talabalar uchun o'z yo'nalishini tanlash imkonini beradi",
    "cards": {
      "one": {
        "title": "ISE (Bakalavr)",
        "descriptionOne": "Bakalavr",
        "descriptionTwo": "4 yil"
      },
      "two": {
        "title": "AI (Magistratura)",
        "descriptionOne": "Magistratura",
        "descriptionTwo": "2 yil"
      }
    },
    "bachelors": {
      "sectionOne": {
        "programTitle": "Bakalavr dasturi",
        "studyMode": "Kunduzgi | Sirtqi",
        "duration": "4 yil",
        "title": "Axborot tizimlarini loyihalash",
        "description": "IT sohasining ko'plab yo'nalishlarini qamrab oluvchi universal dastur"
      },
      "sectionTwo": {
        "title": "Yo'nalish haqida",
        "description": "Axborot tizimlari muhandisligi - bu matematika, biznes va kompyuter fanlari kabi fanlarni birlashtiruvchi fanlararo soha. Axborot tizimlari muhandislari asosan ma'lumotlar uchun ishlatiladigan tizimlarni loyihalashtiradi, ishlab chiqadi, sinovdan o'tkazadi va qo'llab-quvvatlaydi. Axborot tizimlari turli shakllarda bo'lishi mumkin, jumladan, geografik axborot tizimlari, meteorologik tasvirlarni qayta ishlash yoki aloqa tarmoqlari. Axborot tizimlari muhandislari davlat va xususiy sektorlarda, jumladan, mudofaa agentliklari, tibbiyot korxonalari yoki moliyaviy korporatsiyalarda ishlaydi."
      },
      "sectionThree": {
        "title": "Kimlar uchun mos?",
        "cards": {
          "one": {
            "title": "Murakkab IT tizimlar qanday ishlashini tushunishni istaganlar uchun",
            "description": "Siz arxitekturani loyihalash, tahlil qilish va optimallashtirish tamoyillarini o'rganasiz. Bu ishonchli tizimlarni ishlab chiqishga, ularning tuzilishini tushunishga va turli komponentlarning o'zaro ta'sirini anglashga yordam beradi."
          },
          "two": {
            "title": "Ishonchli yechimlar yaratishni istaganlar uchun",
            "description": "Siz katta hajmdagi ma'lumotlarni qayta ishlaydigan, yuklamalarga bardosh beradigan va o'zgarishlarga moslashadigan tizimlarni ishlab chiqishni o'rganasiz. Bu murakkab va barqaror IT infratuzilmasini yaratishda foydali bo'ladi."
          },
          "three": {
            "title": "Raqobatbardoshlikni oshirishni istaganlar uchun",
            "description": "Axborot tizimlarini loyihalash bo'yicha bilimlar turli sohalarda talabga ega. Bu ko'proq martaba imkoniyatlarini ochadi, yuqori lavozimlarga da'vo qilishga imkon beradi va rivojlanish yo'nalishlarini kengaytiradi."
          }
        }
      },
      "sectionFour": {
        "title": "Nimani o'rganasiz?",
        "cards": {
          "one": {
            "title": "Dasturlash va matematikaning asoslari",
            "description": "Boshlanishida siz asosiy dasturlash tillarini, algoritmlar asoslarini, hisoblash matematikasi va fizikani o'rganasiz. Bu keyingi o'qish uchun mustahkam asos yaratadi."
          },
          "two": {
            "title": "Tizimlarni ishlab chiqish va boshqarish",
            "description": "Ma'lumotlar bazalari, kompyuter tarmoqlari, obyektga yo'naltirilgan dasturlash va veb-texnologiyalar bilan ishlashni o'rganasiz. Axborot tizimlarini loyihalash va qo'llab-quvvatlashni o'zlashtirasiz."
          },
          "three": {
            "title": "Ma'lumotlarni tahlil qilish va mashinani o'rganish",
            "description": "Data Science, tizimlarni modellashtirish, kiberxavfsizlik va sun'iy intellekt bilan ishlashni o'rganasiz. Bu aqlli va xavfsiz yechimlarni yaratishga yordam beradi."
          },
          "four": {
            "title": "Loyihalarni boshqarish va amaliy rivojlanish",
            "description": "IT loyihalarini boshqarish, dasturiy ta'minotni sinovdan o'tkazish va IT sohasidagi huquqiy tartibga solish bo'yicha ko'nikmalarni olasiz. Amaliyotlar va yakuniy loyiha davomida bilimlaringizni mustahkamlaysiz."
          }
        }
      },
      "sectionSix": {
        "title": "Dastur",
        "semester": "{semester}-semestr",
        "section": "Bo'lim {chunkIndex} ({count} fanlar)"
      },
      "sectionSeven": {
        "title": "Dastur tuzilishi"
      }
    }
  },
  "teachers": {
    "banner": {
      "title": "Bizning kafedra xodimlari",
      "description": "Bizning mutaxassislarimiz o'z ishini yaxshi biladigan tajribali professionallar. Ularning bilim va ko'nikmalari har qanday murakkablikdagi vazifalarni hal qilishga yordam beradi va rivojlanishga intilishi jamoamizni eng yaxshilaridan biriga aylantiradi.",
      "button": "Batafsil"
    },
    "biography": "Biografiya",
    "history": {
      "title": "Tarix",
      "links": {
        "education": "Ta'lim",
        "work_experience": "Ish tajribasi",
        "research_interests": "Ilmiy qiziqishlar",
        "publications": "Nashrlar"
      },
      "no_data": "Ma'lumot mavjud emas"
    }
  },
  "news": {
    "newsBanner": {
      "title": "Yangiliklar",
      "description": "Innovatsiyalar va texnologiyalar dunyosidagi eng so'nggi yangiliklar",
      "search_placeholder": "Qidiruv"
    }
  },
  "LocaleSwitcher": {
    "label": "Tilni o'zgartirish",
    "locale": "{locale, select, uz {🇺🇿 O'zb} en {🇺🇸 Eng} ru {🇷🇺 Рус} other {unknown}}"
  },
  "footer": {
    "directions": "Yo'nalishlar",
    "bachelors": "AXB (Bakalavr)",
    "masters": "Sun'iy intellekt (Magistratura)",
    "department": "Kafedra",
    "about_us": "Biz haqimizda",
    "teachers": "O'qituvchilar",
    "community": "Hamjamiyat",
    "news": "Yangiliklar",
    "events_calendar": "Tadbirlar taqvimi",
    "contacts": "Aloqalar",
    "address": "Manzil",
    "view_on_map": "Xaritada ko'rish",
    "social_media": "Ijtimoiy tarmoqlar",
    "university_name": "Kimyo Xalqaro Universiteti",
    "all_rights_reserved": "Barcha huquqlar himoyalangan",
    "developed_by": "Ishlab chiqilgan",
    "and": "va"
  }
}
